GKarthik17/EK-RA6M5-Practiced-Projects/UART_1.c
#include "hal_data.h"
#include <stdbool.h>
FSP_CPP_HEADER
void R_BSP_WarmStart(bsp_warm_start_event_t event);
FSP_CPP_FOOTER
volatile bool rx_done = false;
void UART_interrupt(uart_callback_args_t *p_args)
{
    if(p_args->event == UART_EVENT_RX_COMPLETE){
        rx_done = true;
    }
}

/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    /* TODO: add your own code here */
    uint8_t n;
    fsp_err_t err;
    R_SCI_UART_Open(&g_uart0_ctrl, &g_uart0_cfg);
    while(1){
           R_SCI_UART_Read(&g_uart0_ctrl, &n, 1);
           while(!rx_done){

           }

           if(rx_done == true){
               R_IOPORT_PinWrite(&g_ioport_ctrl, BSP_IO_PORT_00_PIN_07 , BSP_IO_LEVEL_HIGH);
               R_BSP_SoftwareDelay(3, BSP_DELAY_UNITS_SECONDS);
               R_IOPORT_PinWrite(&g_ioport_ctrl, BSP_IO_PORT_00_PIN_07 , BSP_IO_LEVEL_LOW);
           }
           err = R_SCI_UART_Write(&g_uart0_ctrl, &n, 1);
           if(err == FSP_SUCCESS){
               R_IOPORT_PinWrite(&g_ioport_ctrl, BSP_IO_PORT_00_PIN_06 , BSP_IO_LEVEL_HIGH);
               R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_SECONDS);
               R_IOPORT_PinWrite(&g_ioport_ctrl, BSP_IO_PORT_00_PIN_06 , BSP_IO_LEVEL_LOW);
           }
           uint8_t m[2] = "\r\n";
           err = R_SCI_UART_Write(&g_uart0_ctrl, m, 2);
           rx_done = false;
    }



#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}

/*******************************************************************************************************************//**
 * This function is called at various points during the startup process.  This implementation uses the event that is
 * called right before main() to set up the pins.
 *
 * @param[in]  event    Where at in the start up process the code is currently at
 **********************************************************************************************************************/
void R_BSP_WarmStart(bsp_warm_start_event_t event)
{
    if (BSP_WARM_START_RESET == event)
    {
#if BSP_FEATURE_FLASH_LP_VERSION != 0

        /* Enable reading from data flash. */
        R_FACI_LP->DFLCTL = 1U;

        /* Would normally have to wait tDSTOP(6us) for data flash recovery. Placing the enable here, before clock and
         * C runtime initialization, should negate the need for a delay since the initialization will typically take more than 6us. */
#endif
    }

    if (BSP_WARM_START_POST_C == event)
    {
        /* C runtime environment and system clocks are setup. */

        /* Configure pins. */
        R_IOPORT_Open (&IOPORT_CFG_CTRL, &IOPORT_CFG_NAME);

#if BSP_CFG_SDRAM_ENABLED

        /* Setup SDRAM and initialize it. Must configure pins first. */
        R_BSP_SdramInit(true);
#endif
    }
}

#if BSP_TZ_SECURE_BUILD

FSP_CPP_HEADER
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ();

/* Trustzone Secure Projects require at least one nonsecure callable function in order to build (Remove this if it is not required to build). */
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ()
{

}
FSP_CPP_FOOTER

#endif
